EmbeddedKitOrg/EmbeddedKit/L1_MCU/STM32F429ZIT6_GCC/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GYRO_CS_Pin         GPIO_PIN_1
#define GYRO_CS_GPIO_Port   GPIOC
#define LCD_NCS_Pin         GPIO_PIN_2
#define LCD_NCS_GPIO_Port   GPIOC
#define USER_KEY_Pin        GPIO_PIN_0
#define USER_KEY_GPIO_Port  GPIOA
#define GYRO_INT1_Pin       GPIO_PIN_1
#define GYRO_INT1_GPIO_Port GPIOA
#define GYRO_INT1_EXTI_IRQn EXTI1_IRQn
#define LCD_RDX_Pin         GPIO_PIN_12
#define LCD_RDX_GPIO_Port   GPIOD
#define LCD_WRX_Pin         GPIO_PIN_13
#define LCD_WRX_GPIO_Port   GPIOD
#define TP_INT_Pin          GPIO_PIN_15
#define TP_INT_GPIO_Port    GPIOA
#define TP_INT_EXTI_IRQn    EXTI15_10_IRQn
#define LED_GREEN_Pin       GPIO_PIN_13
#define LED_GREEN_GPIO_Port GPIOG
#define LED_RED_Pin         GPIO_PIN_14
#define LED_RED_GPIO_Port   GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
